InformationRegisters/ЛогиЗапросов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ЛогиЗапросов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПараметрыЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДлительностьЗапроса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСостояния</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяПолученияОтветаПоЗапросу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяМетода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛогиЗапросов/Ext/ManagerModule.bsl
Процедура СоздатьЗаписьЛога(ВебЗапрос, СтрокаОтвета, Метод, ЛогируемыеМетоды, ДлительностьЗапроса, Ответ = Неопределено) Экспорт

	Попытка
		СтрокаЗапроса = ВебЗапрос.ПолучитьТелоКакСтроку();
		СтруктураЗапроса1 = КоннекторHTTP.JsonВОбъект(ВебЗапрос.ПолучитьТелоКакДвоичныеДанные(),,Новый Структура);		
		ТекМетод = СтруктураЗапроса1.Получить("method");
		Если ТекМетод <> Неопределено Тогда
			Метод = ТекМетод;
		КонецЕсли;
		
		ИдентификаторЗапроса = СтруктураЗапроса1.Получить("id");
		
		Если НужноЛогироватьМетод(Метод) Тогда
			Попытка
				зап = РегистрыСведений.ЛогиЗапросов.СоздатьМенеджерЗаписи();
				зап.Период = ТекущаяДата();
				зап.ИдентификаторЗапроса = ИдентификаторЗапроса;
				зап.ИмяМетода = Метод;
				зап.ПараметрыЗапроса = СтрокаЗапроса;
				зап.Ответ = СтрокаОтвета;
				зап.ДлительностьЗапроса = ДлительностьЗапроса;
					Если Ответ <> Неопределено Тогда 
						Попытка
							зап.КодСостояния = ?(ЗначениеЗаполнено(Ответ.КодСостояния), Ответ.КодСостояния, "");
							зап.ВремяПолученияОтветаПоЗапросу = ?(ЗначениеЗаполнено(Ответ.Заголовки.Получить("Date")), Ответ.Заголовки.Получить("Date"), "");
						Исключение
							зап.КодСостояния = "-";
							зап.ВремяПолученияОтветаПоЗапросу = "-";
						КонецПопытки;
					КонецЕсли;
				зап.Записать();
			Исключение
			КонецПопытки;
		КонецЕсли;
	Исключение
	КонецПопытки
	
КонецПроцедуры

Функция НужноЛогироватьМетод(ИмяМетода) Экспорт
	
	КлючОбъекта  = "ОбработкаНастройкаИнтеграции";
	КлючНастроек = "ЛогированиеСервиса";
	
	ДанныеПонастройкамИнтеграции = ХранилищеОбщихНастроек.Загрузить(КлючОбъекта, КлючНастроек);

	Если ДанныеПонастройкамИнтеграции <> Неопределено Тогда 
		Если ДанныеПонастройкамИнтеграции.Количество() > 0 Тогда
				Для Каждого СтрокаДанных Из ДанныеПонастройкамИнтеграции Цикл
					Если СтрокаДанных.Значение = ИмяМетода Тогда 
						Возврат Истина;
					КонецЕсли;
				КонецЦикла;
			  Возврат Ложь;
			//Индекс = ДанныеПонастройкамИнтеграции.Найти(ИмяМетода);
			//	Если Индекс <> Неопределено Тогда
			//		Возврат Истина;
			//	КонецЕсли;
		Иначе 
			Возврат Ложь;
		КонецЕсли;
	Иначе 
		Возврат Ложь;
	КонецЕсли;

КонецФункции
